In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df.dropna()

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
7,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
13,7.0,0.0,1.0,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S
21,11.0,1.0,3.0,"Sandstrom, Miss. Marguerite Rut",female,4.0,1.0,1.0,PP 9549,16.7000,G6,S
23,12.0,1.0,1.0,"Bonnell, Miss. Elizabeth",female,58.0,0.0,0.0,113783,26.5500,C103,S

In [11]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [12]:
df.head()

    Survived  Pclass     Sex   Age     Fare
3        1.0     1.0  female  38.0  71.2833
7        1.0     1.0  female  35.0  53.1000
13       0.0     1.0    male  54.0  51.8625
21       1.0     3.0  female   4.0  16.7000
23       1.0     1.0  female  58.0  26.5500

In [15]:
input = df.drop('Survived',axis='columns')

In [16]:
target = df['Survived']

In [17]:
input.head()

    Pclass     Sex   Age     Fare
3      1.0  female  38.0  71.2833
7      1.0  female  35.0  53.1000
13     1.0    male  54.0  51.8625
21     3.0  female   4.0  16.7000
23     1.0  female  58.0  26.5500

In [18]:
target.head()

3     1.0
7     1.0
13    0.0
21    1.0
23    1.0
Name: Survived, dtype: float64

In [19]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [22]:
input['Sex_n'] = le_sex.fit_transform(input['Sex'])

In [25]:
input.head()

    Pclass     Sex   Age     Fare  Sex_n
3      1.0  female  38.0  71.2833      0
7      1.0  female  35.0  53.1000      0
13     1.0    male  54.0  51.8625      1
21     3.0  female   4.0  16.7000      0
23     1.0  female  58.0  26.5500      0

In [27]:
newInput = input.drop('Sex',axis='columns')

In [28]:
newInput.head()

    Pclass   Age     Fare  Sex_n
3      1.0  38.0  71.2833      0
7      1.0  35.0  53.1000      0
13     1.0  54.0  51.8625      1
21     3.0   4.0  16.7000      0
23     1.0  58.0  26.5500      0

In [29]:
from sklearn import tree

In [31]:
model = tree.DecisionTreeClassifier()

In [32]:
model.fit(newInput,target)

DecisionTreeClassifier()

In [33]:
model.score(newInput,target)

1.0

In [42]:
model.predict([[1.0,52,52.1000,0]])

C:\Users\Thinkpad\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1.])